jemmicat/Ducati_Mikro/Examples/623_mikromedia__for_stm32_arm___rf_communication_example_v1.0.0.0/nRFControlMaster_stm32_Code/mikroC PRO for ARM/nRFControlMaster_stm32_driver.c
#include "nRFControlMaster_stm32_objects.h"
#include "nRFControlMaster_stm32_resources.h"
#include "built_in.h"


// TFT module connections
unsigned int TFT_DataPort at GPIOE_ODR;
sbit TFT_RST at GPIOF_ODR.B14;
sbit TFT_RS at GPIOF_ODR.B15;
sbit TFT_CS at GPIOF_ODR.B13;
sbit TFT_RD at GPIOF_ODR.B12;
sbit TFT_WR at GPIOF_ODR.B11;
sbit TFT_BLED at GPIOF_ODR.B10;

// Global variables
unsigned int Xcoord, Ycoord;
char PenDown;
typedef unsigned long TPointer;
TPointer PressedObject;
int PressedObjectType;
unsigned int caption_length, caption_height;
unsigned int display_width, display_height;

int _object_count;
unsigned short object_pressed;
TButton *local_button;
TButton *exec_button;
int button_order;
TButton_Round *local_round_button;
TButton_Round *exec_round_button;
int round_button_order;
TLabel *local_label;
TLabel *exec_label;
int label_order;
TCLabel *local_clabel;
TCLabel *exec_clabel;
int clabel_order;
TImage *local_image;
TImage *exec_image;
int image_order;

void Write_to_Data_Lines(unsigned char _hi, unsigned char _lo) {
  unsigned int temp;
  temp = GPIOE_ODR;
  temp &= 0x00FF;
  GPIOE_ODR = temp | (_hi << 8);
  temp = GPIOG_ODR;
  temp &= 0xFF00;
  GPIOG_ODR = temp | _lo;
}

void TFT_mikromedia_Set_Index(unsigned short index) {
  TFT_RS = 0;
  Write_to_Data_Lines(0, index);
  TFT_WR = 0;
  asm nop;
  TFT_WR = 1;
}

void TFT_mikromedia_Write_Command(unsigned short cmd) {
  TFT_RS = 1;
  Write_to_Data_Lines(0, cmd);
  TFT_WR = 0;
  asm nop;
  TFT_WR = 1;
}

void TFT_Write_to_16bitPort(unsigned int _data) {
  TFT_RS = 1;
  Write_to_Data_Lines(Hi(_data), Lo(_data));
  TFT_WR = 0;
  asm nop;
  TFT_WR = 1;
}
static void InitializeTouchPanel() {
    TFT_Set_Active(&TFT_mikromedia_Set_Index, &TFT_mikromedia_Write_Command, &TFT_Write_to_16bitPort);
  TFT_Init_SSD1963(480, 272);

  TFT_Set_DBC_SSD1963(255);

  PenDown = 0;
  PressedObject = 0;
  PressedObjectType = -1;
}

void Calibrate() {
  TFT_Fill_Screen(CL_BLACK);
  TFT_Set_Font(TFT_defaultFont, CL_WHITE, FO_HORIZONTAL);
  TFT_Write_Text("Touch points on the screen as they", 125, 121);
  TFT_Write_Text("appear to calibrate touchscreen.", 135, 151);
  STMPE610_ClearInterruptFlagsAndFIFO();
  TFT_Set_Brush(1, CL_WHITE, 0, 0, 0, 0);
  TFT_Circle(0, 0, 3);
  STMPE610_CalibratePoint(STMPE610_FIRST_CORNER);
  Delay_ms(500);
  TFT_Set_Brush(1, CL_BLACK, 0, 0, 0, 0);
  TFT_Circle(0, 0, 3);
  STMPE610_ClearInterruptFlagsAndFIFO();
  TFT_Set_Brush(1, CL_WHITE, 0, 0, 0, 0);
  TFT_Circle(0, TFT_DISP_HEIGHT-1, 3);
  STMPE610_CalibratePoint(STMPE610_SECOND_CORNER);
  Delay_ms(500);
  TFT_Set_Brush(1, CL_BLACK, 0, 0, 0, 0);
  TFT_Circle(0, TFT_DISP_HEIGHT-1, 3);
  STMPE610_ClearInterruptFlagsAndFIFO();
  TFT_Set_Brush(1, CL_WHITE, 0, 0, 0, 0);
  TFT_Circle(TFT_DISP_WIDTH-1, TFT_DISP_HEIGHT-1, 3);
  STMPE610_CalibratePoint(STMPE610_THIRD_CORNER);
  Delay_ms(500);
  TFT_Set_Brush(1, CL_BLACK, 0, 0, 0, 0);
  TFT_Circle(TFT_DISP_WIDTH-1, TFT_DISP_HEIGHT-1, 3);
  STMPE610_ClearInterruptFlagsAndFIFO();
  TFT_Set_Brush(1, CL_WHITE, 0, 0, 0, 0);
  TFT_Circle(TFT_DISP_WIDTH-1, 0, 3);
  STMPE610_CalibratePoint(STMPE610_FOURTH_CORNER);
  TFT_Set_Brush(1, CL_BLACK, 0, 0, 0, 0);
  TFT_Circle(TFT_DISP_WIDTH-1, 0, 3);
  Delay_ms(500);
}


/////////////////////////
  TScreen*  CurrentScreen;

  TScreen                Screen1;
  TImage               Image1;
  TButton_Round          ButtonRound1;
char ButtonRound1_Caption[1] = "";

  TButton_Round          ButtonRound2;
char ButtonRound2_Caption[1] = "";

  TButton_Round          ButtonRound3;
char ButtonRound3_Caption[1] = "";

  TButton_Round          ButtonRound4;
char ButtonRound4_Caption[1] = "";

  TButton_Round          ButtonRound5;
char ButtonRound5_Caption[1] = "";

  TButton_Round          ButtonRound6;
char ButtonRound6_Caption[1] = "";

  TButton_Round          ButtonRound7;
char ButtonRound7_Caption[1] = "";

  TButton_Round          ButtonRound8;
char ButtonRound8_Caption[1] = "";

  TButton               ButtonAllOn;
char ButtonAllOn_Caption[7] = "ALL ON";

  TButton               ButtonAllOff;
char ButtonAllOff_Caption[8] = "ALL OFF";

  TButton_Round          ButtonRound25;
char ButtonRound25_Caption[1] = "";

  TButton_Round          ButtonRound26;
char ButtonRound26_Caption[1] = "";

  TButton_Round          ButtonRound27;
char ButtonRound27_Caption[1] = "";

  TButton_Round          ButtonRound28;
char ButtonRound28_Caption[1] = "";

  TButton_Round          ButtonRound29;
char ButtonRound29_Caption[1] = "";

  TButton_Round          ButtonRound30;
char ButtonRound30_Caption[1] = "";

  TLabel                 Label1;
char Label1_Caption[9] = "PORT E/H";

  TCLabel          Label2 = 
         {
         &Screen1              , //   Label2.OwnerScreen
         18                    , //   Label2.Order          
         364                   , //   Label2.Left           
         36                    , //   Label2.Top             
         71                    , //   Label2.Width         
         36                    , //   Label2.Height       
         &Label2_Caption       , //   Label2.Caption        
         &Stencil_Std25x36_Regular, //   Label2.FontName       
         0xFFFF                , //   Label2.Font_Color     
         1                     , //   Label2.Visible        
         1                     , //   Label2.Active        
         0                     , //   Label2.OnUpPtr
         0                     , //   Label2.OnDownPtr
         0                     , //   Label2.OnClickPtr
         0                       //   Label2.OnPressPtr
         };
const char Label2_Caption[5] = "Leds";

  TButton                * const code Screen1_Buttons[2]=
         {
         &ButtonAllOn,         
         &ButtonAllOff         
         };
  TButton_Round          * const code Screen1_Buttons_Round[14]=
         {
         &ButtonRound1,        
         &ButtonRound2,        
         &ButtonRound3,        
         &ButtonRound4,        
         &ButtonRound5,        
         &ButtonRound6,        
         &ButtonRound7,        
         &ButtonRound8,        
         &ButtonRound25,       
         &ButtonRound26,       
         &ButtonRound27,       
         &ButtonRound28,       
         &ButtonRound29,       
         &ButtonRound30        
         };
  TLabel                 * const code Screen1_Labels[1]=
         {
         &Label1               
         };
  TCLabel                * const code Screen1_CLabels[1]=
         {
         &Label2               
         };
  TImage                 * const code Screen1_Images[1]=
         {
         &Image1               
         };



static void InitializeObjects() {
  Screen1.Color                     = 0x5AEB;
  Screen1.Width                     = 480;
  Screen1.Height                    = 272;
  Screen1.ButtonsCount              = 2;
  Screen1.Buttons                   = Screen1_Buttons;
  Screen1.Buttons_RoundCount        = 14;
  Screen1.Buttons_Round             = Screen1_Buttons_Round;
  Screen1.LabelsCount               = 1;
  Screen1.Labels                    = Screen1_Labels;
  Screen1.CLabelsCount              = 1;
  Screen1.CLabels                   = Screen1_CLabels;
  Screen1.ImagesCount               = 1;
  Screen1.Images                    = Screen1_Images;
  Screen1.ObjectsCount              = 19;


