jemmicat/Ducati_Mikro/Examples/623_mikromedia__for_stm32_arm___rf_communication_example_v1.0.0.0/nRFControlMaster_stm32_Code/mikroC PRO for ARM/nRFControlMaster_stm32_driver.c
  Image1.OwnerScreen     = &Screen1;
  Image1.Order           = 0;
  Image1.Left            = 0;
  Image1.Top             = 0;
  Image1.Width           = 480;
  Image1.Height          = 272;
  Image1.Picture_Type    = 1;
  Image1.Picture_Ratio   = 1;
  Image1.Picture_Name    = bg_jpg;
  Image1.Visible         = 1;
  Image1.Active          = 1;
  Image1.OnUpPtr         = 0;
  Image1.OnDownPtr       = 0;
  Image1.OnClickPtr      = 0;
  Image1.OnPressPtr      = 0;

  ButtonRound1.OwnerScreen     = &Screen1;
  ButtonRound1.Order           = 1;
  ButtonRound1.Left            = 181;
  ButtonRound1.Top             = 61;
  ButtonRound1.Width           = 30;
  ButtonRound1.Height          = 30;
  ButtonRound1.Pen_Width       = 3;
  ButtonRound1.Pen_Color       = 0x2531;
  ButtonRound1.Visible         = 1;
  ButtonRound1.Active          = 1;
  ButtonRound1.Transparent     = 1;
  ButtonRound1.Caption         = ButtonRound1_Caption;
  ButtonRound1.TextAlign       = _taCenter;
  ButtonRound1.FontName        = Tahoma11x13_Regular;
  ButtonRound1.PressColEnabled = 1;
  ButtonRound1.Font_Color      = 0x0000;
  ButtonRound1.Gradient        = 1;
  ButtonRound1.Gradient_Orientation = 0;
  ButtonRound1.Gradient_Start_Color = 0xC618;
  ButtonRound1.Gradient_End_Color = 0x8410;
  ButtonRound1.Color           = 0xC618;
  ButtonRound1.Press_Color     = 0xE71C;
  ButtonRound1.Corner_Radius   = 3;
  ButtonRound1.OnUpPtr         = 0;
  ButtonRound1.OnDownPtr       = 0;
  ButtonRound1.OnClickPtr      = ButtonRound1OnClick;
  ButtonRound1.OnPressPtr      = 0;

  ButtonRound2.OwnerScreen     = &Screen1;
  ButtonRound2.Order           = 2;
  ButtonRound2.Left            = 181;
  ButtonRound2.Top             = 101;
  ButtonRound2.Width           = 30;
  ButtonRound2.Height          = 30;
  ButtonRound2.Pen_Width       = 3;
  ButtonRound2.Pen_Color       = 0x2531;
  ButtonRound2.Visible         = 1;
  ButtonRound2.Active          = 1;
  ButtonRound2.Transparent     = 1;
  ButtonRound2.Caption         = ButtonRound2_Caption;
  ButtonRound2.TextAlign       = _taCenter;
  ButtonRound2.FontName        = Tahoma11x13_Regular;
  ButtonRound2.PressColEnabled = 1;
  ButtonRound2.Font_Color      = 0x0000;
  ButtonRound2.Gradient        = 1;
  ButtonRound2.Gradient_Orientation = 0;
  ButtonRound2.Gradient_Start_Color = 0xC618;
  ButtonRound2.Gradient_End_Color = 0x8410;
  ButtonRound2.Color           = 0xC618;
  ButtonRound2.Press_Color     = 0xE71C;
  ButtonRound2.Corner_Radius   = 3;
  ButtonRound2.OnUpPtr         = 0;
  ButtonRound2.OnDownPtr       = 0;
  ButtonRound2.OnClickPtr      = ButtonRound2OnClick;
  ButtonRound2.OnPressPtr      = 0;

  ButtonRound3.OwnerScreen     = &Screen1;
  ButtonRound3.Order           = 3;
  ButtonRound3.Left            = 181;
  ButtonRound3.Top             = 142;
  ButtonRound3.Width           = 30;
  ButtonRound3.Height          = 30;
  ButtonRound3.Pen_Width       = 3;
  ButtonRound3.Pen_Color       = 0x2531;
  ButtonRound3.Visible         = 1;
  ButtonRound3.Active          = 1;
  ButtonRound3.Transparent     = 1;
  ButtonRound3.Caption         = ButtonRound3_Caption;
  ButtonRound3.TextAlign       = _taCenter;
  ButtonRound3.FontName        = Tahoma11x13_Regular;
  ButtonRound3.PressColEnabled = 1;
  ButtonRound3.Font_Color      = 0x0000;
  ButtonRound3.Gradient        = 1;
  ButtonRound3.Gradient_Orientation = 0;
  ButtonRound3.Gradient_Start_Color = 0xC618;
  ButtonRound3.Gradient_End_Color = 0x8410;
  ButtonRound3.Color           = 0xC618;
  ButtonRound3.Press_Color     = 0xE71C;
  ButtonRound3.Corner_Radius   = 3;
  ButtonRound3.OnUpPtr         = 0;
  ButtonRound3.OnDownPtr       = 0;
  ButtonRound3.OnClickPtr      = ButtonRound3OnClick;
  ButtonRound3.OnPressPtr      = 0;

  ButtonRound4.OwnerScreen     = &Screen1;
  ButtonRound4.Order           = 4;
  ButtonRound4.Left            = 181;
  ButtonRound4.Top             = 182;
  ButtonRound4.Width           = 30;
  ButtonRound4.Height          = 30;
  ButtonRound4.Pen_Width       = 3;
  ButtonRound4.Pen_Color       = 0x2531;
  ButtonRound4.Visible         = 1;
  ButtonRound4.Active          = 1;
  ButtonRound4.Transparent     = 1;
  ButtonRound4.Caption         = ButtonRound4_Caption;
  ButtonRound4.TextAlign       = _taCenter;
  ButtonRound4.FontName        = Tahoma11x13_Regular;
  ButtonRound4.PressColEnabled = 1;
  ButtonRound4.Font_Color      = 0x0000;
  ButtonRound4.Gradient        = 1;
  ButtonRound4.Gradient_Orientation = 0;
  ButtonRound4.Gradient_Start_Color = 0xC618;
  ButtonRound4.Gradient_End_Color = 0x8410;
  ButtonRound4.Color           = 0xC618;
  ButtonRound4.Press_Color     = 0xE71C;
  ButtonRound4.Corner_Radius   = 3;
  ButtonRound4.OnUpPtr         = 0;
  ButtonRound4.OnDownPtr       = 0;
  ButtonRound4.OnClickPtr      = ButtonRound4OnClick;
  ButtonRound4.OnPressPtr      = 0;

  ButtonRound5.OwnerScreen     = &Screen1;
  ButtonRound5.Order           = 5;
  ButtonRound5.Left            = 274;
  ButtonRound5.Top             = 61;
  ButtonRound5.Width           = 30;
  ButtonRound5.Height          = 30;
  ButtonRound5.Pen_Width       = 3;
  ButtonRound5.Pen_Color       = 0x2531;
  ButtonRound5.Visible         = 1;
  ButtonRound5.Active          = 1;
  ButtonRound5.Transparent     = 1;
  ButtonRound5.Caption         = ButtonRound5_Caption;
  ButtonRound5.TextAlign       = _taCenter;
  ButtonRound5.FontName        = Tahoma11x13_Regular;
  ButtonRound5.PressColEnabled = 1;
  ButtonRound5.Font_Color      = 0x0000;
  ButtonRound5.Gradient        = 1;
  ButtonRound5.Gradient_Orientation = 0;
  ButtonRound5.Gradient_Start_Color = 0xC618;
  ButtonRound5.Gradient_End_Color = 0x8410;
  ButtonRound5.Color           = 0xC618;
  ButtonRound5.Press_Color     = 0xE71C;
  ButtonRound5.Corner_Radius   = 3;
  ButtonRound5.OnUpPtr         = 0;
  ButtonRound5.OnDownPtr       = 0;
  ButtonRound5.OnClickPtr      = ButtonRound5OnClick;
  ButtonRound5.OnPressPtr      = 0;

  ButtonRound6.OwnerScreen     = &Screen1;
  ButtonRound6.Order           = 6;
  ButtonRound6.Left            = 273;
  ButtonRound6.Top             = 101;
  ButtonRound6.Width           = 30;
  ButtonRound6.Height          = 30;
  ButtonRound6.Pen_Width       = 3;
  ButtonRound6.Pen_Color       = 0x2531;
  ButtonRound6.Visible         = 1;
  ButtonRound6.Active          = 1;
  ButtonRound6.Transparent     = 1;
  ButtonRound6.Caption         = ButtonRound6_Caption;
  ButtonRound6.TextAlign       = _taCenter;
  ButtonRound6.FontName        = Tahoma11x13_Regular;
  ButtonRound6.PressColEnabled = 1;
  ButtonRound6.Font_Color      = 0x0000;
  ButtonRound6.Gradient        = 1;
  ButtonRound6.Gradient_Orientation = 0;
  ButtonRound6.Gradient_Start_Color = 0xC618;
  ButtonRound6.Gradient_End_Color = 0x8410;
  ButtonRound6.Color           = 0xC618;
  ButtonRound6.Press_Color     = 0xE71C;
  ButtonRound6.Corner_Radius   = 3;
  ButtonRound6.OnUpPtr         = 0;
  ButtonRound6.OnDownPtr       = 0;
  ButtonRound6.OnClickPtr      = ButtonRound6OnClick;
  ButtonRound6.OnPressPtr      = 0;

  ButtonRound7.OwnerScreen     = &Screen1;
  ButtonRound7.Order           = 7;
  ButtonRound7.Left            = 273;
  ButtonRound7.Top             = 142;
  ButtonRound7.Width           = 30;
  ButtonRound7.Height          = 30;
  ButtonRound7.Pen_Width       = 3;
  ButtonRound7.Pen_Color       = 0x2531;
  ButtonRound7.Visible         = 1;
  ButtonRound7.Active          = 1;
  ButtonRound7.Transparent     = 1;
  ButtonRound7.Caption         = ButtonRound7_Caption;
  ButtonRound7.TextAlign       = _taCenter;
  ButtonRound7.FontName        = Tahoma11x13_Regular;
  ButtonRound7.PressColEnabled = 1;
  ButtonRound7.Font_Color      = 0x0000;
  ButtonRound7.Gradient        = 1;
  ButtonRound7.Gradient_Orientation = 0;
  ButtonRound7.Gradient_Start_Color = 0xC618;
  ButtonRound7.Gradient_End_Color = 0x8410;
  ButtonRound7.Color           = 0xC618;
  ButtonRound7.Press_Color     = 0xE71C;
  ButtonRound7.Corner_Radius   = 3;
  ButtonRound7.OnUpPtr         = 0;
  ButtonRound7.OnDownPtr       = 0;
  ButtonRound7.OnClickPtr      = ButtonRound7OnClick;
  ButtonRound7.OnPressPtr      = 0;

