jemmicat/Ducati_Mikro/Examples/623_mikromedia__for_stm32_arm___rf_communication_example_v1.0.0.0/nRFControlMaster_stm32_Code/mikroC PRO for ARM/nRFControlMaster_stm32_driver.c
  ButtonRound8.OwnerScreen     = &Screen1;
  ButtonRound8.Order           = 8;
  ButtonRound8.Left            = 273;
  ButtonRound8.Top             = 182;
  ButtonRound8.Width           = 30;
  ButtonRound8.Height          = 30;
  ButtonRound8.Pen_Width       = 3;
  ButtonRound8.Pen_Color       = 0x2531;
  ButtonRound8.Visible         = 1;
  ButtonRound8.Active          = 1;
  ButtonRound8.Transparent     = 1;
  ButtonRound8.Caption         = ButtonRound8_Caption;
  ButtonRound8.TextAlign       = _taCenter;
  ButtonRound8.FontName        = Tahoma11x13_Regular;
  ButtonRound8.PressColEnabled = 1;
  ButtonRound8.Font_Color      = 0x0000;
  ButtonRound8.Gradient        = 1;
  ButtonRound8.Gradient_Orientation = 0;
  ButtonRound8.Gradient_Start_Color = 0xC618;
  ButtonRound8.Gradient_End_Color = 0x8410;
  ButtonRound8.Color           = 0xC618;
  ButtonRound8.Press_Color     = 0xE71C;
  ButtonRound8.Corner_Radius   = 3;
  ButtonRound8.OnUpPtr         = 0;
  ButtonRound8.OnDownPtr       = 0;
  ButtonRound8.OnClickPtr      = ButtonRound8OnClick;
  ButtonRound8.OnPressPtr      = 0;

  ButtonAllOn.OwnerScreen     = &Screen1;
  ButtonAllOn.Order           = 9;
  ButtonAllOn.Left            = 11;
  ButtonAllOn.Top             = 228;
  ButtonAllOn.Width           = 75;
  ButtonAllOn.Height          = 31;
  ButtonAllOn.Pen_Width       = 4;
  ButtonAllOn.Pen_Color       = 0x2531;
  ButtonAllOn.Visible         = 1;
  ButtonAllOn.Active          = 1;
  ButtonAllOn.Transparent     = 1;
  ButtonAllOn.Caption         = ButtonAllOn_Caption;
  ButtonAllOn.TextAlign       = _taCenter;
  ButtonAllOn.FontName        = Tahoma13x13_Bold;
  ButtonAllOn.PressColEnabled = 1;
  ButtonAllOn.Font_Color      = 0x0000;
  ButtonAllOn.Gradient        = 1;
  ButtonAllOn.Gradient_Orientation = 0;
  ButtonAllOn.Gradient_Start_Color = 0xFFFF;
  ButtonAllOn.Gradient_End_Color = 0xC618;
  ButtonAllOn.Color           = 0xC618;
  ButtonAllOn.Press_Color     = 0xE71C;
  ButtonAllOn.OnUpPtr         = 0;
  ButtonAllOn.OnDownPtr       = 0;
  ButtonAllOn.OnClickPtr      = ButtonAllOnOnClick;
  ButtonAllOn.OnPressPtr      = 0;

  ButtonAllOff.OwnerScreen     = &Screen1;
  ButtonAllOff.Order           = 10;
  ButtonAllOff.Left            = 394;
  ButtonAllOff.Top             = 228;
  ButtonAllOff.Width           = 75;
  ButtonAllOff.Height          = 31;
  ButtonAllOff.Pen_Width       = 4;
  ButtonAllOff.Pen_Color       = 0x2531;
  ButtonAllOff.Visible         = 1;
  ButtonAllOff.Active          = 1;
  ButtonAllOff.Transparent     = 1;
  ButtonAllOff.Caption         = ButtonAllOff_Caption;
  ButtonAllOff.TextAlign       = _taCenter;
  ButtonAllOff.FontName        = Tahoma13x13_Bold;
  ButtonAllOff.PressColEnabled = 1;
  ButtonAllOff.Font_Color      = 0x0000;
  ButtonAllOff.Gradient        = 1;
  ButtonAllOff.Gradient_Orientation = 0;
  ButtonAllOff.Gradient_Start_Color = 0xFFFF;
  ButtonAllOff.Gradient_End_Color = 0xC618;
  ButtonAllOff.Color           = 0xC618;
  ButtonAllOff.Press_Color     = 0xE71C;
  ButtonAllOff.OnUpPtr         = 0;
  ButtonAllOff.OnDownPtr       = 0;
  ButtonAllOff.OnClickPtr      = ButtonAllOffOnClick;
  ButtonAllOff.OnPressPtr      = 0;

  ButtonRound25.OwnerScreen     = &Screen1;
  ButtonRound25.Order           = 11;
  ButtonRound25.Left            = 103;
  ButtonRound25.Top             = 61;
  ButtonRound25.Width           = 30;
  ButtonRound25.Height          = 30;
  ButtonRound25.Pen_Width       = 3;
  ButtonRound25.Pen_Color       = 0x2531;
  ButtonRound25.Visible         = 1;
  ButtonRound25.Active          = 1;
  ButtonRound25.Transparent     = 1;
  ButtonRound25.Caption         = ButtonRound25_Caption;
  ButtonRound25.TextAlign       = _taCenter;
  ButtonRound25.FontName        = Tahoma11x13_Regular;
  ButtonRound25.PressColEnabled = 1;
  ButtonRound25.Font_Color      = 0x0000;
  ButtonRound25.Gradient        = 1;
  ButtonRound25.Gradient_Orientation = 0;
  ButtonRound25.Gradient_Start_Color = 0x8410;
  ButtonRound25.Gradient_End_Color = 0x0000;
  ButtonRound25.Color           = 0xC618;
  ButtonRound25.Press_Color     = 0xE71C;
  ButtonRound25.Corner_Radius   = 3;
  ButtonRound25.OnUpPtr         = 0;
  ButtonRound25.OnDownPtr       = 0;
  ButtonRound25.OnClickPtr      = ButtonRound25OnClick;
  ButtonRound25.OnPressPtr      = 0;

  ButtonRound26.OwnerScreen     = &Screen1;
  ButtonRound26.Order           = 12;
  ButtonRound26.Left            = 103;
  ButtonRound26.Top             = 101;
  ButtonRound26.Width           = 30;
  ButtonRound26.Height          = 30;
  ButtonRound26.Pen_Width       = 3;
  ButtonRound26.Pen_Color       = 0x2531;
  ButtonRound26.Visible         = 1;
  ButtonRound26.Active          = 1;
  ButtonRound26.Transparent     = 1;
  ButtonRound26.Caption         = ButtonRound26_Caption;
  ButtonRound26.TextAlign       = _taCenter;
  ButtonRound26.FontName        = Tahoma11x13_Regular;
  ButtonRound26.PressColEnabled = 1;
  ButtonRound26.Font_Color      = 0x0000;
  ButtonRound26.Gradient        = 1;
  ButtonRound26.Gradient_Orientation = 0;
  ButtonRound26.Gradient_Start_Color = 0x8410;
  ButtonRound26.Gradient_End_Color = 0x0000;
  ButtonRound26.Color           = 0xC618;
  ButtonRound26.Press_Color     = 0xE71C;
  ButtonRound26.Corner_Radius   = 3;
  ButtonRound26.OnUpPtr         = 0;
  ButtonRound26.OnDownPtr       = 0;
  ButtonRound26.OnClickPtr      = ButtonRound26OnClick;
  ButtonRound26.OnPressPtr      = 0;

  ButtonRound27.OwnerScreen     = &Screen1;
  ButtonRound27.Order           = 13;
  ButtonRound27.Left            = 103;
  ButtonRound27.Top             = 142;
  ButtonRound27.Width           = 30;
  ButtonRound27.Height          = 30;
  ButtonRound27.Pen_Width       = 3;
  ButtonRound27.Pen_Color       = 0x2531;
  ButtonRound27.Visible         = 1;
  ButtonRound27.Active          = 1;
  ButtonRound27.Transparent     = 1;
  ButtonRound27.Caption         = ButtonRound27_Caption;
  ButtonRound27.TextAlign       = _taCenter;
  ButtonRound27.FontName        = Tahoma11x13_Regular;
  ButtonRound27.PressColEnabled = 1;
  ButtonRound27.Font_Color      = 0x0000;
  ButtonRound27.Gradient        = 1;
  ButtonRound27.Gradient_Orientation = 0;
  ButtonRound27.Gradient_Start_Color = 0x8410;
  ButtonRound27.Gradient_End_Color = 0x0000;
  ButtonRound27.Color           = 0xC618;
  ButtonRound27.Press_Color     = 0xE71C;
  ButtonRound27.Corner_Radius   = 3;
  ButtonRound27.OnUpPtr         = 0;
  ButtonRound27.OnDownPtr       = 0;
  ButtonRound27.OnClickPtr      = ButtonRound27OnClick;
  ButtonRound27.OnPressPtr      = 0;

