jemmicat/Ducati_Mikro/Examples/623_mikromedia__for_stm32_arm___rf_communication_example_v1.0.0.0/nRFControlMaster_stm32_Code/mikroC PRO for ARM/nRFControlMaster_stm32_driver.c
  ButtonRound28.OwnerScreen     = &Screen1;
  ButtonRound28.Order           = 14;
  ButtonRound28.Left            = 103;
  ButtonRound28.Top             = 182;
  ButtonRound28.Width           = 30;
  ButtonRound28.Height          = 30;
  ButtonRound28.Pen_Width       = 3;
  ButtonRound28.Pen_Color       = 0x2531;
  ButtonRound28.Visible         = 1;
  ButtonRound28.Active          = 1;
  ButtonRound28.Transparent     = 1;
  ButtonRound28.Caption         = ButtonRound28_Caption;
  ButtonRound28.TextAlign       = _taCenter;
  ButtonRound28.FontName        = Tahoma11x13_Regular;
  ButtonRound28.PressColEnabled = 1;
  ButtonRound28.Font_Color      = 0x0000;
  ButtonRound28.Gradient        = 1;
  ButtonRound28.Gradient_Orientation = 0;
  ButtonRound28.Gradient_Start_Color = 0x8410;
  ButtonRound28.Gradient_End_Color = 0x0000;
  ButtonRound28.Color           = 0xC618;
  ButtonRound28.Press_Color     = 0xE71C;
  ButtonRound28.Corner_Radius   = 3;
  ButtonRound28.OnUpPtr         = 0;
  ButtonRound28.OnDownPtr       = 0;
  ButtonRound28.OnClickPtr      = ButtonRound28OnClick;
  ButtonRound28.OnPressPtr      = 0;

  ButtonRound29.OwnerScreen     = &Screen1;
  ButtonRound29.Order           = 15;
  ButtonRound29.Left            = 181;
  ButtonRound29.Top             = 8;
  ButtonRound29.Width           = 30;
  ButtonRound29.Height          = 30;
  ButtonRound29.Pen_Width       = 3;
  ButtonRound29.Pen_Color       = 0x2531;
  ButtonRound29.Visible         = 1;
  ButtonRound29.Active          = 1;
  ButtonRound29.Transparent     = 1;
  ButtonRound29.Caption         = ButtonRound29_Caption;
  ButtonRound29.TextAlign       = _taCenter;
  ButtonRound29.FontName        = Tahoma11x13_Regular;
  ButtonRound29.PressColEnabled = 1;
  ButtonRound29.Font_Color      = 0x0000;
  ButtonRound29.Gradient        = 1;
  ButtonRound29.Gradient_Orientation = 0;
  ButtonRound29.Gradient_Start_Color = 0x8410;
  ButtonRound29.Gradient_End_Color = 0x0000;
  ButtonRound29.Color           = 0xC618;
  ButtonRound29.Press_Color     = 0xE71C;
  ButtonRound29.Corner_Radius   = 3;
  ButtonRound29.OnUpPtr         = 0;
  ButtonRound29.OnDownPtr       = 0;
  ButtonRound29.OnClickPtr      = ButtonRound29OnClick;
  ButtonRound29.OnPressPtr      = 0;

  ButtonRound30.OwnerScreen     = &Screen1;
  ButtonRound30.Order           = 16;
  ButtonRound30.Left            = 273;
  ButtonRound30.Top             = 8;
  ButtonRound30.Width           = 30;
  ButtonRound30.Height          = 30;
  ButtonRound30.Pen_Width       = 3;
  ButtonRound30.Pen_Color       = 0x2531;
  ButtonRound30.Visible         = 1;
  ButtonRound30.Active          = 1;
  ButtonRound30.Transparent     = 1;
  ButtonRound30.Caption         = ButtonRound30_Caption;
  ButtonRound30.TextAlign       = _taCenter;
  ButtonRound30.FontName        = Tahoma11x13_Regular;
  ButtonRound30.PressColEnabled = 1;
  ButtonRound30.Font_Color      = 0x0000;
  ButtonRound30.Gradient        = 1;
  ButtonRound30.Gradient_Orientation = 0;
  ButtonRound30.Gradient_Start_Color = 0x8410;
  ButtonRound30.Gradient_End_Color = 0x0000;
  ButtonRound30.Color           = 0xC618;
  ButtonRound30.Press_Color     = 0xE71C;
  ButtonRound30.Corner_Radius   = 3;
  ButtonRound30.OnUpPtr         = 0;
  ButtonRound30.OnDownPtr       = 0;
  ButtonRound30.OnClickPtr      = ButtonRound30OnClick;
  ButtonRound30.OnPressPtr      = 0;

  Label1.OwnerScreen     = &Screen1;
  Label1.Order           = 17;
  Label1.Left            = 333;
  Label1.Top             = 6;
  Label1.Width           = 135;
  Label1.Height          = 36;
  Label1.Visible         = 1;
  Label1.Active          = 1;
  Label1.Caption         = Label1_Caption;
  Label1.FontName        = Stencil_Std25x36_Regular;
  Label1.Font_Color      = 0xFFFF;
  Label1.OnUpPtr         = 0;
  Label1.OnDownPtr       = 0;
  Label1.OnClickPtr      = 0;
  Label1.OnPressPtr      = 0;
}

static char IsInsideObject (unsigned int X, unsigned int Y, unsigned int Left, unsigned int Top, unsigned int Width, unsigned int Height) { // static
  if ( (Left<= X) && (Left+ Width - 1 >= X) &&
       (Top <= Y)  && (Top + Height - 1 >= Y) )
    return 1;
  else
    return 0;
}


#define GetButton(index)              CurrentScreen->Buttons[index]
#define GetRoundButton(index)         CurrentScreen->Buttons_Round[index]
#define GetLabel(index)               CurrentScreen->Labels[index]
#define GetCLabel(index)              CurrentScreen->CLabels[index]
#define GetImage(index)               CurrentScreen->Images[index]


void DrawButton(TButton *Abutton) {
  if (Abutton->Visible == 1) {
    if (object_pressed == 1) {
      object_pressed = 0;
      TFT_Set_Brush(Abutton->Transparent, Abutton->Press_Color, Abutton->Gradient, Abutton->Gradient_Orientation, Abutton->Gradient_End_Color, Abutton->Gradient_Start_Color);
    }
    else {
      TFT_Set_Brush(Abutton->Transparent, Abutton->Color, Abutton->Gradient, Abutton->Gradient_Orientation, Abutton->Gradient_Start_Color, Abutton->Gradient_End_Color);
    }
    TFT_Set_Pen(Abutton->Pen_Color, Abutton->Pen_Width);
    TFT_Rectangle(Abutton->Left, Abutton->Top, Abutton->Left + Abutton->Width - 1, Abutton->Top + Abutton->Height - 1);
    TFT_Set_Font(Abutton->FontName, Abutton->Font_Color, FO_HORIZONTAL);
    TFT_Write_Text_Return_Pos(Abutton->Caption, Abutton->Left, Abutton->Top);
    if (Abutton->TextAlign == _taLeft)
      TFT_Write_Text(Abutton->Caption, Abutton->Left + 4, (Abutton->Top + ((Abutton->Height - caption_height) / 2)));
    else if (Abutton->TextAlign == _taCenter)
      TFT_Write_Text(Abutton->Caption, (Abutton->Left + (Abutton->Width - caption_length) / 2), (Abutton->Top + ((Abutton->Height - caption_height) / 2)));
    else if (Abutton->TextAlign == _taRight)
      TFT_Write_Text(Abutton->Caption, Abutton->Left + (Abutton->Width - caption_length - 4), (Abutton->Top + (Abutton->Height - caption_height) / 2));
  }
}

void DrawRoundButton(TButton_Round *Around_button) {
    if (Around_button->Visible == 1) {
      if (object_pressed == 1) {
        object_pressed = 0;
        TFT_Set_Brush(Around_button->Transparent, Around_button->Press_Color, Around_button->Gradient, Around_button->Gradient_Orientation,
                      Around_button->Gradient_End_Color, Around_button->Gradient_Start_Color);
      }
      else {
        TFT_Set_Brush(Around_button->Transparent, Around_button->Color, Around_button->Gradient, Around_button->Gradient_Orientation,
                      Around_button->Gradient_Start_Color, Around_button->Gradient_End_Color);
      }
      TFT_Set_Pen(Around_button->Pen_Color, Around_button->Pen_Width);
      TFT_Rectangle_Round_Edges(Around_button->Left + 1, Around_button->Top + 1,
        Around_button->Left + Around_button->Width - 2,
        Around_button->Top + Around_button->Height - 2, Around_button->Corner_Radius);
      TFT_Set_Font(Around_button->FontName, Around_button->Font_Color, FO_HORIZONTAL);
      TFT_Write_Text_Return_Pos(Around_button->Caption, Around_button->Left, Around_button->Top);
      if (Around_button->TextAlign == _taLeft)
        TFT_Write_Text(Around_button->Caption, Around_button->Left + 4, (Around_button->Top + ((Around_button->Height - caption_height) / 2)));
      else if (Around_button->TextAlign == _taCenter)
        TFT_Write_Text(Around_button->Caption, (Around_button->Left + (Around_button->Width - caption_length) / 2), (Around_button->Top + ((Around_button->Height - caption_height) / 2)));
      else if (Around_button->TextAlign == _taRight)
        TFT_Write_Text(Around_button->Caption, Around_button->Left + (Around_button->Width - caption_length - 4), (Around_button->Top + (Around_button->Height - caption_height) / 2));
    }
}

void DrawLabel(TLabel *ALabel) {
  if (ALabel->Visible == 1) {
    TFT_Set_Font(ALabel->FontName, ALabel->Font_Color, FO_HORIZONTAL);
    TFT_Write_Text(ALabel->Caption, ALabel->Left, ALabel->Top);
  }
}

